# Задача 12: Петя и Катя – брат и сестра. Петя – студент,
# а Катя – школьница. Петя помогает Кате по математике.
# Он задумывает два натуральных числа X и Y (X,Y≤1000),
# а Катя должна их отгадать. Для этого Петя делает две подсказки.
# Он называет сумму этих чисел S и их произведение P.
# Помогите Кате отгадать задуманные Петей числа.

s = int(input("Enter SUM of numbers: "))
p = int(input("Enter Multiply of numbers: "))

for x in range(1, s+1):
    if p % x == 0:
        y = p // x
        if x + y == s:
            print("Answer: ", x, y)
            break
else:
    print("It's not working!")
